{
  "title": "How to Measure Your Pupillary Distance(PD)?",
  "description": "What Is PD?\n\nPD(or pupillary distance) is the distance between your pupils in millimeter. Your PD is very important for accurately fitting your lenses to achieve vision acurity. In general, this number will be provided on your prescription after the eye exam; if not, you can also get it measured at home. All you need is a friend or a mirror and a ruler.\n\nMeasure it by a mirror\nMeasure it with a friend’s help\nStep 1: Stand with a friend facing you, look straight ahead and place the ruler on the bridge of your nose.\nStep 2: Close your left eye and let your friend align the 0 mm over the center of your right pupil.\nStep 3: Close your right eye and open the left, then let your friend note the reading directly over your left pupil. That will be your PD.\nStep 4: For measuring a PD with high accuracy, please do it 3 times and take an average number of them as the final PD measurement.\n\nTwo PDs?\nMeasure the distance from two pupils to the center of nose respectively.\nNotes:\n1. The average PD is between 54mm and 78mm.\n2. For those requiring progressive lenses, we strongly recommend you get this information from your optician to ensure the accuracy of your glasses.\n3. Your PD may be written in three ways:\n▪ PD (OU), written as \"64\", means the Binocular PD which is for both eyes.\n▪ PD (OD), means the Monocular PD for the right eye, PD (OS), means the Monocular PD for the left eye. A Monocular OD is written as two numbers, for example \"32/30\", \"32\" represents the PD for the right eye, and \"30\" for the left eye.\n▪ Sometimes PD is written as \"62/59\" or they are labeled \"Far\" and \"Near\". Your PD is usually measured for distance vision, which is \"Far PD\", or \"62\" in this example. For reading glasses, doctors measure your \"Near PD\" or \"59\" in the example.\nAlways enter your \"Far PD\" for distance vision eyeglasses and enter your \"Near PD\" for your reading glasses only. For most people, the difference between Far PD and Near PD is about 2-3mm.",
  "photo": "/assets/img/uploads/IMG_2364.PNG"
}