{"2020-03-08-12-54":{"publishedOn":"2020-03-08-08-53","body":"Various types of led light-emitting display devices, such as TVs, computers, and mobile phones, etc, have made the image quality more bright and beautiful, which tends to increase the blue light intensity of led backlights. With the popularity of these electronic products and penetration into all aspects of life, the chance of each person's exposure to blue light has increased dramatically. For ordinary people, blocking long-time exposure to blue light is the most effective way to reduce damage, and the use of anti-blue light glasses can effectively solve this problem.\\nThe anti-blue light lens is a lens that prevents blue light from irritating the eyes. The special anti-blue lens can effectively isolate ultraviolet light and radiation and can filter blue light, which is suitable for people who often watch TV, computer or mobile phone.\\nHazards of Blue Light\\n\\nDamage to Eyes\\nHarmful blue light has extremely high energy and can penetrate the lens to the retina, causing the atrophy and even death of retinal pigment epithelial cells. The death of light-sensitive cells will result in decreased or even complete loss of vision, which is irreversible. Blue light can also cause maculopathy.\\n\\nVisual Fatigue:\\nBecause of the shorter wavelength of blue light, the focus is not on the center of the retina, but farther forward. To see clearly, the eyeball is in tension for a long time, causing eye strain. Long-term visual fatigue may cause symptoms such as deepening myopia, double vision, easy serialization when reading and inability to concentrate, affecting people's learning and working efficiency.\\n\\nPoor Sleep Quality:\\nBlue light inhibits the production of melatonin, which is an important hormone that affects sleep and regulates jet lag. This is why playing with your phone or tablet before bed can lead to poor sleep or even difficulty falling asleep.\\n\\nWhy Choose Anti-blue Light Lens\\n\\nAnti-blue light glasses can effectively reduce the sustained damage of blue light to the eyes. Through the comparative detection of portable spectrum analyzer, the intensity of blue light emitted by the mobile phone screen is effectively inhibited after the use of anti-blue light glasses, reducing the harmful blue light to the eyes. They mainly reflect the harmful blue light by coating the surface of the lens, or absorb the harmful blue light by adding anti-blue light factor into the substrate of the lens, so as to achieve the barrier of harmful blue light and protect the eyes.","title":"Anti-blue Light Lens","photo":"/assets/img/uploads/IMG_2369.JPG"},"2020-03-08-12-55":{"publishedOn":"2020-03-08-08-54","title":"How to Measure Your Pupillary Distance(PD)?","body":"What Is PD?\\n\\nPD(or pupillary distance) is the distance between your pupils in millimeter. Your PD is very important for accurately fitting your lenses to achieve vision acurity. In general, this number will be provided on your prescription after the eye exam; if not, you can also get it measured at home. All you need is a friend or a mirror and a ruler.\\n\\nMeasure it by a mirror\\nMeasure it with a friend’s help\\nStep 1: Stand with a friend facing you, look straight ahead and place the ruler on the bridge of your nose.\\nStep 2: Close your left eye and let your friend align the 0 mm over the center of your right pupil.\\nStep 3: Close your right eye and open the left, then let your friend note the reading directly over your left pupil. That will be your PD.\\nStep 4: For measuring a PD with high accuracy, please do it 3 times and take an average number of them as the final PD measurement.\\n\\nTwo PDs?\\nMeasure the distance from two pupils to the center of nose respectively.\\nNotes:\\n1. The average PD is between 54mm and 78mm.\\n2. For those requiring progressive lenses, we strongly recommend you get this information from your optician to ensure the accuracy of your glasses.\\n3. Your PD may be written in three ways:\\n▪ PD (OU), written as \\\"64\\\", means the Binocular PD which is for both eyes.\\n▪ PD (OD), means the Monocular PD for the right eye, PD (OS), means the Monocular PD for the left eye. A Monocular OD is written as two numbers, for example \\\"32/30\\\", \\\"32\\\" represents the PD for the right eye, and \\\"30\\\" for the left eye.\\n▪ Sometimes PD is written as \\\"62/59\\\" or they are labeled \\\"Far\\\" and \\\"Near\\\". Your PD is usually measured for distance vision, which is \\\"Far PD\\\", or \\\"62\\\" in this example. For reading glasses, doctors measure your \\\"Near PD\\\" or \\\"59\\\" in the example.\\nAlways enter your \\\"Far PD\\\" for distance vision eyeglasses and enter your \\\"Near PD\\\" for your reading glasses only. For most people, the difference between Far PD and Near PD is about 2-3mm.","photo":"/assets/img/uploads/IMG_2364.PNG"},"2020-03-22-13-54":{"publishedOn":"2020-03-22-09-51","title":"Finding your Face Shape","body":"When shopping for a new pair of glasses, it's best to find a pair that compliments your \nfeatures based on your face shape.\n\nThere are 5 common face shapes: Oval, Heart, Square, Diamond & Round.","photo":"/assets/img/uploads/2bd65020-556d-4ed5-9192-68c04e137157.jpeg"}}