{
  "returns": "Sunnies By Richie aims to provide you a perfect pair of eyeglasses at the best price. If you have any problems, please feel free to contact us. Our customer service will offer you a reasonable solution for all kinds of problems with the glasses in 10 days from the date you receive the glasses. Two weeks warranty for manufactures defects only.",
  "telephone": "246-252-4019",
  "bio": "Our founder, RICHIEANN BOSTIC got tired of seeing her mother & grand mother wearing boring glasses for decades. She decided to change the eyewear business with a large pool of self designed, and optical experts. That's the beginning of the SUNNIES BY RICHIE quest, with a clear mission: to become the place for beautifully made frames that match you in every possible way.",
  "vision": "SUNNIES BY RICHIE has a team which keeps their fingers on the pulse of the fashion and entertainment industry. The company prides itsselves on always being ahead of the curve but having the trending styles and colours for every occasion. As a result the website is a fluid one and is constantly updated with you, the customer in mind.\n\nEach style is handpicked by RICHIEANN still to ensure only the best frames, materials, accessories and suppliers for our customers. The over all goal is still and will always be keeping cost to a minimum.",
  "biophoto": "/assets/img/uploads/18ca8a8e-18ad-4a83-b5a0-4ef6de349cfa 2.JPG",
  "logo": "/assets/img/uploads/logo_large.jpg",
  "mission": "SUNNIES BY RICHIE is a boutique retailer and wholesaler of quality eyewear and eyewear accesories. This small business established in 2017 is the brainchild of owner and Managing Director                                                     \nRICHIEANN BOSTIC after realising there was a niche in the Bajan Market which was becoming more sophisticated. What was a huge risk at the time is now her labour of love.",
  "shipping": "At SUNNIES BY RICHIE, we do our best to ensure that your lenses and frames are produced promptly and made to match your vision care needs.\n\nYou vision and your business is important to us. With our partners' laboratories, expert professional staff, and frame stock that are stored in-house, we can provide you not only with high quality glasses, but also with prompt processing times.  We can produce your glasses and ship them to you in the shortest time span possible – all across the globe.\n\nWe appreciate your patience. Please note:\n* Strong Prescriptions - Prescriptions with CYL of +/- 3.00 and above\nGlasses with tinted lenses or Transitions lenses will require additional days to process.\nIf your prescription is incomplete or we have questions about your order, including the prescription, you will be notified and it may cause delays in production.\nAll international shipments are subject to import taxes and VAT.",
  "bioname": "RICHIEANN BOSTIC",
  "address": " Wellhouse St Philip",
  "socialmedia": {
    "facebook": "https://www.facebook.com/richie.uluvka.9",
    "twitter": "none",
    "instagram": "https://www.instagram.com/shopsunniesbyrichie/"
  },
  "title": "Company Information",
  "email": "info@sunniesbyrichie.com",
  "description": "\"As a brand we are well aware of the economic climate. This guides Team Sunnies” every move towards Affordable luxury and the best value to you our customers. - RICHIEANN"
}