{
  "publishedOn": "2020-03-08-08-53",
  "body": "Various types of led light-emitting display devices, such as TVs, computers, and mobile phones, etc, have made the image quality more bright and beautiful, which tends to increase the blue light intensity of led backlights. With the popularity of these electronic products and penetration into all aspects of life, the chance of each person's exposure to blue light has increased dramatically. For ordinary people, blocking long-time exposure to blue light is the most effective way to reduce damage, and the use of anti-blue light glasses can effectively solve this problem.\\nThe anti-blue light lens is a lens that prevents blue light from irritating the eyes. The special anti-blue lens can effectively isolate ultraviolet light and radiation and can filter blue light, which is suitable for people who often watch TV, computer or mobile phone.\\nHazards of Blue Light\\n\\nDamage to Eyes\\nHarmful blue light has extremely high energy and can penetrate the lens to the retina, causing the atrophy and even death of retinal pigment epithelial cells. The death of light-sensitive cells will result in decreased or even complete loss of vision, which is irreversible. Blue light can also cause maculopathy.\\n\\nVisual Fatigue:\\nBecause of the shorter wavelength of blue light, the focus is not on the center of the retina, but farther forward. To see clearly, the eyeball is in tension for a long time, causing eye strain. Long-term visual fatigue may cause symptoms such as deepening myopia, double vision, easy serialization when reading and inability to concentrate, affecting people's learning and working efficiency.\\n\\nPoor Sleep Quality:\\nBlue light inhibits the production of melatonin, which is an important hormone that affects sleep and regulates jet lag. This is why playing with your phone or tablet before bed can lead to poor sleep or even difficulty falling asleep.\\n\\nWhy Choose Anti-blue Light Lens\\n\\nAnti-blue light glasses can effectively reduce the sustained damage of blue light to the eyes. Through the comparative detection of portable spectrum analyzer, the intensity of blue light emitted by the mobile phone screen is effectively inhibited after the use of anti-blue light glasses, reducing the harmful blue light to the eyes. They mainly reflect the harmful blue light by coating the surface of the lens, or absorb the harmful blue light by adding anti-blue light factor into the substrate of the lens, so as to achieve the barrier of harmful blue light and protect the eyes.",
  "title": "Anti-blue Light Lens",
  "photo": "/assets/img/uploads/IMG_2369.JPG"
}